{
  "privacy": {
    "title": "Политика конфиденциальности",
    "lastUpdated": "Последнее обновление: 7 февраля 2026 г.",
    "sections": {
      "1": {
        "heading": "1. Введение",
        "content": "Rynetic (\"Мы\" или \"Бот\") обязуется защищать вашу конфиденциальность. Данная Политика конфиденциальности объясняет, как мы собираем, используем, раскрываем и защищаем ваши данные при использовании нашего сервиса Discord."
      },
      "2": {
        "heading": "2. Информация, которую мы собираем",
        "intro": "Мы собираем информацию, которую вы добровольно предоставляете при взаимодействии с Rynetic, включая:",
        "items": [
          "Идентификатор и имя пользователя Discord",
          "Содержание сообщений, которые вы запрашиваете обработать",
          "Метаданные команд (временные метки, ID сервера)",
          "Настройки предпочтений пользователя"
        ]
      },
      "3": {
        "heading": "3. Использование информации",
        "intro": "Мы используем собранную информацию для:",
        "items": [
          "Предоставления функциональности модерации и развлечения",
          "Улучшения и персонализации опыта использования Бота",
          "Мониторинга нарушений условий обслуживания",
          "Информирования о важных обновлениях и уведомлениях безопасности",
          "Соответствия требованиям законодательства"
        ]
      },
      "4": {
        "heading": "4. Обмен информацией",
        "content": "Мы не продаем, не сдаем в аренду и не обмениваем ваши личные данные с третьими сторонами. Мы делимся данными с третьими сторонами только в случае, когда это требуется по закону (например, в ответ на судебное постановление) или когда это необходимо для предоставления наших услуг (например, размещение сервера)."
      },
      "5": {
        "heading": "5. Хранение данных",
        "content": "Мы сохраняем данные пользователей столько времени, сколько необходимо для предоставления наших услуг или в соответствии с требованиями законодательства. Неиспользуемые данные могут быть удалены через 12 месяцев. Вы имеете право запросить удаление ваших данных в любой момент."
      },
      "6": {
        "heading": "6. Безопасность данных",
        "content": "Мы реализуем технические, административные и физические меры безопасности для защиты ваших личных данных от несанкционированного доступа, изменения, раскрытия или уничтожения. Однако ни один метод передачи в интернете не является полностью безопасным."
      },
      "7": {
        "heading": "7. Права на конфиденциальность",
        "intro": "В зависимости от вашего местоположения вы можете иметь следующие права:",
        "items": [
          "Право доступа к вашим личным данным",
          "Право исправления неправильных данных",
          "Право удаления ('право быть забытым')",
          "Право ограничения обработки",
          "Право на переносимость данных",
          "Право на возражение против обработки"
        ]
      },
      "8": {
        "heading": "8. Ссылки на третьих сторон",
        "content": "Rynetic может содержать ссылки на веб-сайты третьих сторон. Мы не несем ответственности за политику конфиденциальности этих сайтов. Мы рекомендуем вам прочитать их политику конфиденциальности перед предоставлением личной информации."
      },
      "9": {
        "heading": "9. Конфиденциальность несовершеннолетних",
        "content": "Rynetic не предназначен для лиц моложе 13 лет. Мы сознательно не собираем личную информацию от несовершеннолетних. Если мы обнаружим, что собрали данные несовершеннолетнего, мы немедленно удалим их."
      },
      "10": {
        "heading": "10. CCPA - Закон о конфиденциальности потребителей Калифорнии",
        "content": "Если вы являетесь жителем Калифорнии, у вас есть дополнительные права в соответствии с CCPA, включая право знать, право на удаление, право отказа и право на недискриминацию. Свяжитесь с нашей службой поддержки для осуществления этих прав."
      },
      "11": {
        "heading": "11. GDPR - Общее положение о защите данных",
        "content": "Если вы являетесь жителем ЕС, ваши данные защищены GDPR. Мы имеем законную основу для обработки ваших данных только с вашего согласия. Вы имеете право отозвать согласие в любой момент, связавшись с нашей службой поддержки."
      },
      "12": {
        "heading": "12. Свяжитесь с нами",
        "intro": "Если у вас есть вопросы или опасения по поводу нашей Политики конфиденциальности, свяжитесь с нами на нашем сервере поддержки:",
        "supportServer": "Discord Support Server: https://discord.gg/UcvuXJvnCg"
      },
      "13": {
        "heading": "13. Изменения в этой политике",
        "content": "Мы оставляем за собой право изменять эту Политику конфиденциальности в любое время. Если мы внесем существенные изменения, мы уведомим вас через наш сервер поддержки. Продолжение использования Rynetic после публикации изменений означает, что вы принимаете изменения."
      },
      "14": {
        "heading": "14. Глоссарий",
        "intro": "Ключевые термины, используемые в этой политике:",
        "items": [
          "Личные данные: Любая информация, которая идентифицирует или может идентифицировать человека",
          "Обработка: Любая операция, выполняемая на данных, включая сбор, использование и хранение",
          "Согласие: Ваше сознательное и добровольное согласие на обработку личных данных",
          "Сервер: Сообщество Discord, защищенное Rynetic"
        ]
      }
    }
  }
}
