{
  "terms": {
    "title": "Условия Обслуживания",
    "lastUpdated": "Последнее обновление: 7 февраля 2026 г.",
    "sections": {
      "1": {
        "heading": "1. Согласие с условиями",
        "content": "Используя Rynetic (\"Бот\"), вы соглашаетесь соблюдать и быть связанными этими Условиями обслуживания (\"Условия\"). Если вы не согласны с вышеперечисленным, пожалуйста, не используйте этот сервис."
      },
      "2": {
        "heading": "2. Лицензия на использование",
        "content": "Разрешение предоставляется на использование Rynetic только в законных целях. Вы соглашаетесь не использовать Бот каким-либо образом, нарушающим применимое законодательство или условия обслуживания Discord, Inc. Запрещенное поведение включает преследование или причинение беспокойства любому лицу, непристойный или оскорбительный контент и нарушение нормального хода диалога в коммуникации нашего Бота."
      },
      "3": {
        "heading": "3. Ответственность пользователя",
        "intro": "Как пользователь Rynetic, вы соглашаетесь:",
        "items": [
          "Не использовать Бот для преследования, угроз или оскорбления других пользователей.",
          "Не пытаться эксплуатировать, взламывать или вмешиваться в функциональность Бота.",
          "Не использовать Бот для распространения вредоносного программного обеспечения или вредоносного контента.",
          "Не спамить и не переполнять серверы командами.",
          "Соблюдать все применимые законы и Условия обслуживания Discord.",
          "Не использовать Бот для выполнения автоматических действий, противоречащих политике Discord."
        ]
      },
      "4": {
        "heading": "4. Функции модерации и развлечения",
        "content": "Rynetic предоставляет инструменты модерации для помощи администраторам серверов в управлении своими сообществами. Пользователи несут ответственность за ответственное и законное использование функций модерации. Функции развлечения Бота предоставляются \"как есть\" в целях развлечения."
      },
      "5": {
        "heading": "5. Отказ от гарантий",
        "content": "Rynetic предоставляется \"КАК ЕСТЬ\" и \"КАК ДОСТУПЕН\" без каких-либо гарантий, явных или подразумеваемых. Мы не гарантируем, что Бот будет беспрерывным или свободным от ошибок. Мы не несем ответственность за какие-либо убытки, вытекающие из использования или невозможности использования Бота."
      },
      "6": {
        "heading": "6. Ограничение ответственности",
        "content": "Ни при каких обстоятельствах Rynetic, его владельцы или участники не несут ответственности за косвенные, случайные, специальные, косвенные или штрафные убытки, включая, помимо прочего, убытки от потери прибыли, деловой репутации, использования, данных или других нематериальных потерь."
      },
      "7": {
        "heading": "7. Прекращение",
        "content": "Мы оставляем за собой право прекратить или приостановить обслуживание бота для любого пользователя или сервера, нарушающего эти Условия или совершающего вредоносное поведение. Пользователи, нарушившие эти Условия, могут быть заблокированы от использования Бота."
      },
      "8": {
        "heading": "8. Изменения условий",
        "content": "Мы оставляем за собой право изменять эти Условия в любое время. Если мы внесем существенные изменения, мы уведомим пользователей через наш сервер поддержки. Продолжение использования Rynetic после публикации пересмотренных Условий означает, что вы принимаете и согласны с изменениями."
      },
      "9": {
        "heading": "9. Применимое право",
        "content": "Эти Условия и положения регулируются и толкуются в соответствии с применимым международным правом, и вы безвозмездно подчиняетесь исключительной юрисдикции судов в этом месте."
      },
      "10": {
        "heading": "10. Информация для контактов",
        "intro": "Если у вас есть какие-либо вопросы об этих Условиях обслуживания, свяжитесь с нами на нашем сервере поддержки:",
        "supportServer": "Discord Support Server: https://discord.gg/UcvuXJvnCg"
      }
    }
  }
}
